app/views/users/show.html.erb

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `envelopes` WHERE (`envelopes`.recipient_id = 3)) AS subquery
SELECT `envelopes`.* FROM `envelopes` WHERE (`envelopes`.recipient_id_id = 3 AND `envelopes`.recipient_id_type = 'User')
SELECT `messages`.* FROM `messages` WHERE (`messages`.user_id = 3 AND (to_user = 2173169460))
---
	<% else %>
		<%= link_to "You have " + pluralize(@user.envelopes.count, "message") + ".", "/inbox" %>

SELECT * FROM `courses` INNER JOIN `courses_schedules` ON `courses`.id = `courses_schedules`.course_id WHERE (`courses_schedules`.schedule_id = 1 )
SELECT `schedules`.* FROM `schedules` WHERE (`schedules`.user_id = 3) LIMIT 1
---
	<h3>Your Schedule</h3>
	<%= @user.schedules.first.courses.inspect %>