app/controllers/courses_controller.rb

  def load_from_yaml
      require 'yaml'

      f = File.read("test/curriculum.yaml") #filename
      cs = YAML::load ( f )

      cs.each do |c|
          course = Course.new(c)
          course.save
---
INSERT INTO `courses` (`course_code`, `created_at`, `credits`, `description`, `instructor`, `subject`, `time`, `time_parsed`, `title`, `updated_at`) VALUES ('AH2259.01', '2010-09-13 01:21:59', 4, 'We shall begin with the first self-conscious stirrings of Romantic art and literature, from about 1760 to 1820. Among the major artists covered will be Piranesi, Greuze, David, Gericault, Ingres, Blake, and Goya. Readings will be drawn primarily from the poets and philosophers of the period, including Coleridge, Wordsworth, Blake, Burke, Kant, Diderot, Rousseau, and Winckelmann. In art, our emphasis will be on the intimate relationship between late Neoclassicism and Romanticism, and on how the Romantic impulse originated in sketchbooks, small paintings, diaries, and other highly personal creations. In both art and literature our principal topics will include the budding interest in spontaneity and chaos; the investigation of and sympathy with madness; the primacy accorded to the erotic impulse; and the fascination with the demonic and the revolutionary.\n\nPrerequisites: None.\n\n', 'Dan Hofstadter', 'AH', 'MTh 2:10 - 6pm', '--- \n- dtend: \n - 18\n - 0\n dtstart: \n - 14\n - 10\n byday: \n - MO\n - TH\n', 'The Birth of Romanticism: 1760 - 1820', '2010-09-13 01:21:59')

  def index
    @title = "Course Listing"
    @courses = Course.all(:order => "course_code ASC")
---
SELECT `courses`.* FROM `courses` ORDER BY course_code ASC

  def show
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 1) LIMIT 1

  def edit
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 1) LIMIT 1