app/controllers/schedules_controller.rb

  def index
    @schedules = Schedule.all
---
SELECT `schedules`.* FROM `schedules`

  def show
    @schedule = Schedule.find(params[:id])
---
SELECT `schedules`.* FROM `schedules` WHERE (`schedules`.`id` = 1) LIMIT 1

  def create
    @schedule = Schedule.new(params[:schedule])

    respond_to do |format|
      if @schedule.save
---
INSERT INTO `schedules` (`courses`, `created_at`, `student_id`, `updated_at`) VALUES ('this that the other thing', '2010-09-09 21:56:41', 1, '2010-09-09 21:56:41')

  def add_course_remote
    @schedule = Schedule.find(current_user.current_schedule)
    @course = Course.find(params[:id])
---
SELECT `schedules`.* FROM `schedules` WHERE (`schedules`.user_id = 3) LIMIT 1
SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 1) LIMIT 1