app/controllers/sessions_controller.rb

  def create
    logout_keeping_session!
    user = User.authenticate(params[:login], params[:password])
    if user
      # Protects against session fixation attacks, causes request forgery
      # protection if user resubmits an earlier form using back
      # button. Uncomment if you understand the tradeoffs.
      # reset_session
      self.current_user = user
      new_cookie_flag = (params[:remember_me] == "1")
      handle_remember_cookie! new_cookie_flag
      redirect_back_or_default('/profile', :notice => "Logged in successfully.  Welcome, " + ( user.preferred_name or user.first_name) + "!")
---
SELECT `users`.* FROM `users` WHERE (login = 'mnunes' and activated_at IS NOT NULL) LIMIT 1