app/controllers/users_controller.rb

INSERT INTO `users` (`activated_at`, `activation_code`, `class_year`, `created_at`, `crypted_password`, `email`, `first_name`, `last_name`, `login`, `permissions`, `preferred_name`, `remember_token`, `remember_token_expires_at`, `salt`, `updated_at`) VALUES (NULL, '7cafd985e3c15a6ccdd6259ce175d3a1399e0828', '2011', '2010-09-17 17:57:04', '2751a970e70333ee958258e54eef2ab794b050f9', 'mnunes@bennington.edu', 'Matthew', 'Nunes', 'matt_nunes', 'user', '', NULL, NULL, 'd8eb6240bc92b97365701eb9213c3f911a374009', '2010-09-17 17:57:04')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

SELECT `users`.* FROM `users` WHERE (`users`.`activation_code` = 'bd35c1de1f516aec7242c80f5299cd089048fddf') LIMIT 1
---
  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show
    if params[:id]
      @user = User.find(params[:id])